
### :robot: Terraform Report
---
##### Plan: `3` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["helm-viewer"] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "selected"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "helm-viewer"

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "ahmadnassri/action-terraform-report@*",
            ]
          + verified_allowed     = true
        }
    }

  # github_repository.repositories["helm-viewer"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Quick tool to easily view your helm charts."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = false
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://helm-viewer.vercel.app"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "helm-viewer"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "charts",
          + "helm",
          + "helm-charts",
          + "kubernetes",
          + "templates",
          + "yaml",
        ]
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_file.renovate_json["helm-viewer"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "helm-viewer"
      + sha                          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11314673298`](https://github.com/Tchoupinax/repo-config/actions/runs/11314673298) - commit ec87e8be0f1f4060ef09850bdbf68f1d42c9272a
